#Даны строки S, S1 и S2. Заменить в строке S все вхождения строки S1 на строку S2/
S = 'как будет видно ночью красиво'
S1 = 'ночью'
S2 = 'днём'

tjt = S.replace(S1, S2)
print(tjt)